butaneVerification/0/thermo:Cv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thermo:Cv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 -1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
2217.1
2217.13
2217.16
2217.19
2217.22
2217.26
2217.29
2217.32
...
)
;

boundaryField
{
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40002
(
2487.55
2217.1
2217.1
2217.13
2217.16
2217.19
2217.22
2217.26
...
)
;
    }
}


// ************************************************************************* //
