butaneVerification/constant/reactions
species
(
    C4H10
);

reactions
{
}
